---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry
source: html/0307827a-fdb4-badb-6b59-3ecf87b4985b.htm
---
# ExtElemChangeBeamSectionRegistry Methods

Registers a IExtElemChangeBeamSection